/*
SELECT *
FROM symptom AS s
 JOIN symptom_has_doctor AS ad
ON s.ID = ad.symptom_ID
 JOIN doctor as d
ON ad.doctor_ID = d.ID
*/


INSERT INTO part VALUES (NULL, 'Вуха');
INSERT INTO part VALUES (NULL, 'Голова');
INSERT INTO part VALUES (NULL, 'Груди');
INSERT INTO part VALUES (NULL, 'Живіт');
INSERT INTO part VALUES (NULL, 'Ніс');
INSERT INTO part VALUES (NULL, 'Ноги');
INSERT INTO part VALUES (NULL, 'Очі');
INSERT INTO part VALUES (NULL, 'Передпліччя');
INSERT INTO part VALUES (NULL, "Психологічне здоров'я");
INSERT INTO part VALUES (NULL, 'Рот');
INSERT INTO part VALUES (NULL, 'Руки');
INSERT INTO part VALUES (NULL, 'Спина');
INSERT INTO part VALUES (NULL, "Фізичне здоров'я");
INSERT INTO part VALUES (NULL, 'Шия');
INSERT INTO part VALUES (NULL, 'Шкіра');
INSERT INTO part VALUES (NULL, 'Ступні');



INSERT INTO symptom VALUES (NULL, "Амнезія", "Амнезія - втрата пам'яті, часткова або повна, тимчасова або постійна. 

Амнезію може викликати будь-який досить сильний емоційний шок. Загалом її причини поділяються на психологічні або органічні. Якщо причина психологічна, амнезію називають психогенною; вона є симптомом диссоціативної реакції, при якій уявлення хворого про самого себе в минулому досвіді відокремлюються від основного потоку свідомості. Органічні причини включають як пошкодження головного мозку (наприклад, струс головного мозку), так і його морфологічні зміни (викликаються, наприклад, атеросклерозом артерій). Амнезія може супроводжувати також деякі види епілепсії, афазії або шизофренії.

Існує чотири види амнезії, що розрізняються характером і ступенем втрати пам'яті.

При антероградній амнезії пам'ять страждає таким чином, що хворий не пам'ятає нічого з того, що сталося після початку захворювання, але добре пам'ятає все, що було до цього.

Ретроградна амнезія характеризується тим, що хворий не може згадати минулих подій або свідчень, але пам'ятає все, що сталося після виникнення амнезії. Такий вид амнезії часто спостерігається після струсів мозку.

При парамнезії пам'ять спотворює добре знайомі факти і відомості.

Четвертий вид амнезії визначається як реакція втечі, або як стан психогенної втечі. Це диссоціативне порушення, при якому хворий забуває все своє минуле життя і те хто він є (тобто втрачає свою ідентичність); він може навіть почати нове життя в зовсім іншому оточенні. Зазвичай це викликається важким емоційним шоком чи особистими переживаннями і триває іноді досить довго.", 2);


INSERT INTO symptom VALUES (NULL, "Галюцинації", "Галюцинації - це розлади сприйняття, коли хворий бачить, чує або відчуває те, чого немає насправді. Розрізняють галюцинації: зорові, нюхові, слухові, смакові, загального почуття (вісцеральні і м'язові). 

Зорові галюцинації, що характеризуються баченням хворим різних неіснуючих в реальності образів або сцен, в яких він може приймати участь. Можуть з'явитися внаслідок отруєння алкоголем (один із симптомів білої гарячки), при вживанні наркотиків або психостимулюючих речовин (наприклад, ЛСД, гашиш, опій, кокаїн і ряд інших), передозування лікарськими засобами, а також певних органічних структур олова. 

Зорові, поряд (в поєднанні) зі слуховими галюцинаціями, притаманні для деяких хвороб, наприклад, педункулярний галюциноз.

«Голос згори», накази і похвали від невидимих друзів, оклики - все це відноситься до слухових галюцинацій, часто є симптомом шизофренії, передозування алкоголем, отруєння і простих парціальних припадків.

Відчуття неіснуючих запахів характерно для нюхових галюцинацій, які зустрічаються при шизофренії, що частіше змушує відчувати хворих неприємні запахи - гнилі, протухлого і так далі. Також їх може викликати ураження головного мозку, а саме його скроневої частки. Герпетичний енцефаліт, а також парціальні припадки можуть додати до нюхових ще й смакові галюцинації, під час яких хворі відчувають неіснуючий приємний, або огидний смак в роті.

Галюцинації тактильного характеру виявляються у відчутті предметів, яких насправді не існує. Причина виникнення - алкогольний абстинентний синдром. Супроводжується також слуховими і зоровими порушеннями реальності.

Під час тілесних галюцинацій хворий відчуває різні неприємні відчуття, наприклад, проходження через тіло електричного струму. Також це можуть бути дотики до тіла, хапання за кінцівки, відчуття бульбашок в животі. Спостерігаються при таких захворюваннях, як шизофренія і енцефаліт.

Крім диференціації за джерелом виникнення галюцинації поділяються на справжні і несправжні. При істинних галюцинаціях людина є спостерігачем з боку, образи, які вона бачить, існують в точній проекції реальності. Особливістю помилкових галюцинацій є те, що вони не виходять за межі голови хворого і проектуються виключно в ній. Це означає, що органи чуття при таких галюцинаціях не задіяні.

Галюцинації можуть бути як простими, так і складними. При простих галюцинаціях порушується робота лише одного з органів почуттів, у той час як при складних захоплюється як мінімум два. Це означає, що якщо до вас в гості одного разу прийде маленький чортик, ви не тільки побачите його візуальний образ, але ще відчуєте як сковує м'язи холод і зможете з ним поговорити по душах. 

Складні галюцинації можуть виникнути тільки при певному рівні самонавіювання, психічних порушень чи порушень в роботі головного мозку (травма, інсульт, рак мозку).", 2);


INSERT INTO symptom VALUES (NULL, "Головний біль при інфекціях", "Головний біль - досить частий симптом при інфекційних захворюваннях. Найчастіше це наслідок інтоксикації, тобто впливу на організм людини токсинів мікроорганізму (найбільш часто при грипі , ГРВІ), що викликає захворювання. При цьому головний біль виникає на тлі типових ознак інтоксикації - підвищення температури тіла, іноді ознобу, ломоти у м'язах, болю в очах. Найчастіше головний біль при простудних захворюваннях і грипі - помірної інтенсивності, і проходить після прийому жарознижуючих засобів.

Головний біль також буває характерною ознакою менінгококової інфекції. При найнебезпечніших її формах - менінгококкцеміі (коли мікроорганізми потрапляють в кров) і менінгококовому менінгіті (при ураженні мозкових оболонок) - головний біль є одним з перших симптомів. Менінгококова інфекція вкрай небезпечна, існують блискавичні форми захворювання, що призводять до смерті за кілька годин; своєчасна діагностика захворювання вкрай важлива для успішного лікування.", 2);



INSERT INTO symptom VALUES (NULL, "Головний біль при алергії", "Алергія може стати причиною виникнення вторинного головного болю як симптому основного захворювання.

Головний біль буває первинним (у 95% випадків) і вторинним (в 5%). 

До первинних головних болів відносять мігрень, пучкові головні болі, головні болі м'язового напруження. Первинний головний біль є самостійним захворюванням. 

Вторинний головний або симптоматичний біль є проявом яких-небудь захворювань (черепно-мозкова травма, судинна патологія мозку, пухлини і т.д.).", 2);



INSERT INTO symptom VALUES (NULL, "Головний біль при глаукомі", "При глаукомі у пацієнта може відзначатися головний біль. Біль носить тупий, ниючий характер, часто поєднується з болем всередині ока та за оком. Пацієнт відчуває ніби розпирання, тяжкість за оком і в голові. У першу чергу це пов'язано з високим внутрішньо-очним тиском.", 
2);



INSERT INTO symptom VALUES (NULL, "Блювота", "Блювота - виверження шлункового і кишкового вмісту через рот і носові ходи.

Види блювоти:

- «Мозкова» - при інсультах, менінгітах, енцефалітах, гідроцефалії, мігрені, струсі головного мозку, неврозах, психозах.

- «Токсична» блювота викликається токсичними речовинами, що циркулюють в крові. Виникає при отруєнні чадним газом, прийомі деяких ліків (індометацин, тетрациклін, трихопол, аспірин у великих дозах), токсикоинфекциях, алкогольному отруєнні, гострій нирковій недостатності, цукровому діабеті, поширених опіках.

- «Рефлекторна» блювота виникає при хронічному запаленні глотки. Причиною цього можуть бути часті запалення носа і горла, діабет, хвороби кишечника, шлунку, серця, легень, печінки, нирок, апендициті, непрохідності кишечника.

- Блювота при патології органів рівноваги (морська хвороба).

- Блювота нерідко виникає в першому триместрі вагітності (токсикоз)", 4);



INSERT INTO symptom VALUES (NULL, "Біль внизу живота", "Біль внизу живота - найпоширеніша скарга в гінекологічній практиці.
Цей симптом дуже неспецифічний, так як виникає при багатьох захворюваннях. Оскільки в області тазу концентрація чутливих нервових гангліїв невелика, больові імпульси, що йдуть від органів малого таза, погано диференціюються в ЦНС і часто біль здається іррадіюючим, іноді жінка відчуває біль після усунення його причини (фантомний біль). 

Обстежуючи пацієнта із скаргами на біль внизу живота, необхідно враховувати і індивідуальне сприйняття болю, і різний поріг больової чутливості.

Важливі характеристики болю внизу живота - це його виникнення (гостре або поступове), локалізація болю, супутні симптоми (наприклад, жар, озноб, анорексія, нудота, блювота або кровотеча). Необхідно визначити, чи пов'язаний біль з менструальним циклом, чи представляє небезпеку для життя, чи потрібні реанімаційні заходи, чи є зв'язок з вагітністю.

Найчастіше болями внизу живота посередині у жінок проявляється гострий цистит. Одночасно можуть бути присутніми прискорене сечовипускання, біль наприкінці сечовипускання, може з'являтися кров у сечі. Якщо цих симптомів немає, то не виключено, що мова може йти про проблеми з кишечником, запалення придатків і цілий ряд інших захворювань. У будь-якому випадку є необхідність пройти обстеження у уролога та гінеколога, або у фахівця з урогінекології.

Крім проблем з кишечником болі внизу живота праворуч або ліворуч у жінки можуть бути ознакою аднекситу - запалення придатків матки, кісти яєчника і ще цілого ряду захворювань придатків у жінок. При появі такого болю обов'язково якомога швидше пройти обстеження у гінеколога.

Кровотечі з статевих шляхів у поєднанні з болем внизу живота, як правило, виникають при захворюваннях статевої системи.

Підвищення температури тіла і озноб часто супроводжують інфекції малого таза (гонорея; уреаплазмоз; мікоплазмоз; хламідіоз).

Анорексія, нудота і блювота - неспецифічні симптоми, які часто супроводжують захворювань шлунково-кишкового тракту.

Непритомність, судинний колапс і шок, що виникають в результаті гіповолемії, зазвичай вказує на внутрішньочеревну кровотечу.

Часте хворобливе сечовипускання, біль в попереку або гематурія – ознаки патології сечовивідних шляхів.

Раптовий початок болю свідчить про гострі патології: прорив, кровотеча, розрив або перекрут органу, такі ж симптоми можуть розвинутися при кольках сечовивідних шляхів або шлунково-кишкового тракту.

Пульсуючий, ритмічний біль характерний для підвищеного внутрішньопорожнинного тиску в порожнистих органах.

Постійний біль зазвичай буває при запальному процесі, перерозтяганні капсули паренхіматозного органу, порушення кровопостачання органу.

Гострий біль характерний для непрохідності сечовивідних шляхів, непрохідності кишечника, гострої патології очеревини.

Тупий біль найбільше характерна для запального процесу.

Тривалість і періодичність больових епізодів допомагають встановити характер захворювання (гострий або хронічний). Якщо подібні болі часто виникали і раніше, чи біль турбує жінку довго, найбільш ймовірно хронічне захворювання.

Гострі напади болю протягом тривалого часу, що тривають менше 48 годин, можуть виникати вдруге внаслідок хронічного захворювання (наприклад, болю при овуляції ).

Сила больового нападу може бути оцінена за зовнішнім виглядом хворої (блідість, пітливість, вираз обличчя).", 4);



INSERT INTO symptom VALUES (NULL, "Діарея", "Діарея – це часте або одноразове випорожнення кишечнику з виділенням рідкої калової маси.

Маса випорожнень здорових дорослих коливається від 100 до 300 г/добу і залежить від кількості клітковини в їжі та обсягу засвоєної води і незасвоєних речовин. 

Діарея може бути гострою, якщо тривалість її не перевищує 2-3 тижнів. І хронічною, якщо рідкий кал триває більше 3 тижнів. Поняття хронічної діареї включає також систематично рясний стілець, маса якого перевищує 300 г /добу. 

Діарея з'являється у випадку, коли кількість води в калі збільшується від 60 до 90%. У хворих з порушеним всмоктуванням харчових речовин переважає поліфекалія, тобто незвично велику кількість калової маси, представленої незасвоєними залишками їжі. При порушенні моторики кишечника кал може бути частим і рідким, але добова кількість його може не перевищувати 200-300г. 

Таким чином, вже початковий аналіз особливостей діареї дозволяє встановити причину збільшення обсягу калових мас і може полегшити діагностику і вибір методу лікування.", 4);



INSERT INTO symptom VALUES (NULL, "Сухі очі", "Сухість очей - це нормальна реакція ока на погоду чи медикаменти. Сухість очей може також бути причиною різних тимчасових або хронічних захворювань. Сльози виділяються лакрімальной залозою, яка розташована в зовнішньому покриві очного яблука. Сльози формують водяну оболонку, мінеральну оболонку, і облонку з антитіл. Вологість для зовнішнього покриву очного яблука і рогівки дуже важлива, щоб уникнути пошкодження рогівки.

Зазвичай від сухості очей страждають літні люди. Проте останнім часом сухість очей часто виникає і у молодих людей, які багато часу проводять за комп'ютерами. Користувачі контактними лінзами можуть відчувати сухість очей в приміщенні з кондиціонуванням повітря, при роботі за комп'ютером, при знаходженні в умовах сухого повітря, на сильному вітрі і в інших несприятливих для очей умовах.

Для того щоб усунути симптоми сухості очей, зазвичай застосовують препарати штучної сльози, для користувачів контактними лінзами випускаються спеціальні зволожуючі змащувальні краплі.

Синдром сухого ока

Синдром сухого ока виникає, коли поверхня очей погано зволожується і змащується. Утончення слізної плівки або порушення її складу призводить до підсихання рогівки ока, виникає відчуття сухості, подразнення очей. Око стає підвищено чутливим до сухості повітря, до сигаретного диму тощо. Порушення нормального зволоження і змащування ока може відбуватися з різних причин.

Чинники, що викликають сухість очей

- Вік. Вважається , що сухість ока з'являється приблизно у 7% людей у віці близько 50-60 років і у 15 % у віці 70 років і старше. Причому жінки відчувають сухість очей частіше за чоловіків. З віком наші очі менше виділяють слізної рідини, і її не вистачає для нормального змочування ока. Погіршується і склад слізної плівки. Брак слізної рідини і порушення її складу посилюються в несприятливих зовнішніх умовах (сухість повітря, дим тощо). 
- Ліки. Деякі ліки при тривалому застосуванні мають в якості побічного ефекту сухість очей або посилюють вже наявний стан сухості. До таких препаратів належать: діуретики (сечогінні препарати), деякі антидепресанти, антигістамінні, оральні контрацептивні засоби, бета-блокатори, очні краплі, які застосовуються для лікування інших хвороб ока, препарати для лікування виразкової хвороби та деякі інші. 
- Хвороби. У деяких людей сухість ока з'являється як симптом загального захворювання організму. Наприклад, сухість ока може розвинутися при ревматоїдному артриті, синдромі Сегрена, системному червоному вовчаку та ін.", 7);



INSERT INTO symptom VALUES (NULL, "Сльозоточивість", "Сльозовиділення - це нормальна функція очей. Сильне сльозовиділення - це ознака їх захворювання. Сльози з'являються з лакримальной залози, яка розташована на зовнішньому покриві очного яблука. Сльози формують водяну оболонку ока, мінеральну оболонку, і антитіла. Вологість важлива для зовнішнього покриву очного яблука, рогівки, щоб уникнути її пошкодження. Якщо лакримальні канали заблоковані, то може з'явитися сильне сльозовиділення.

До гіперсекреторної сльозоточивості відносяться: 

- алергічна реакція на той чи інший подразник (ліки, харчування, сезонна реакція на цвітіння, фарбу, різкі запахи, косметику, тварин); 
- компенсаторне збільшення продукування слізної рідини при синдромі «сухого ока»; його причиною є тривала і напружена (для очей) робота з паперами або комп'ютером, тривалий перегляд телепередач і хронічна втома;
- запальні очні захворювання, в т . ч. блефарит (в основному у літніх людей), кератит, кон'юнктивіт. Найчастіше зараження інфекційним кон'юнктивітом відбувається через недотримання гігієнічних норм і правил. Кон'юнктивіт також може бути алергічним; 
- нестача вітаміну B2 і K; 
- механічний, хімічний або світловий характер роздратування рогівки або кон'юнктиви. Це може бути опік рогівки, отриманий після відвідування солярію, довгої фіксації погляду на сонці або присутності при зварювальних роботах . Сльозотеча починається вже через кілька годин після дії УФ-променів; 
- також, нерідко сльозоточивість очей виникає у людей, які носять контактні лінзи (вони можуть бути неправильно підібрані) і при неправильному зростанні вій. 
- крім того, сльозотеча можуть викликати вітер, яскраве сонце, пил , хімічні дрібнодисперсні і рідкі засоби; 
- нерідко причиною сльозоточивості є простудні захворювання (ГРВІ).", 7);



INSERT INTO symptom VALUES (NULL, "Потемніння в очах", "Епізоди потемніння в очах часто спостерігаються при брадикардії (зменшенні частоти пульсу) і пов'язані з недостатнім кровопостачанням головного мозку. Ці епізоди часто супроводжуються відчуттям 'різкого припливу жару до голови', нудоти. Також потемніння в очах може бути пов’язаним з порушеннями роботі самого органу зору, низькому рівні гемоглобіну (анемія) чи тяжких фізичних навантаженнях.

Причини виникнення потемніння в очах

Існує 2 основних групи причин потемніння в очах: що криються в мозку або виникають в органах зору. Причини раптового потемніння в очах:

- зниження артеріального тиску в результаті перенапруження або навантажень - з'являється у зв'язку з недостатнім кровопостачанням мозку в результаті відтоку від нього крові (ортостатична гіпертензія);
- перевтома ;
- низький рівень гемоглобіну;
- вегето-судинна дистонія .
- постійні потемніння в очах можуть спостерігатися на тлі дефектів полів зору (скотоми). Причини появи можуть бути пов'язані з дефектом сприйняття (погана робота органів зору) і з дефектом передачі картинки в мозок (виникає при відхиленнях в системі зорового нерва).

Так само напади потемніння очах можуть бути пов'язані з проблемами в хребетних артеріях, які відповідають за постачання кисню до кори головного мозку.

Діагностика потемніння в очах

При виникненні потемніння в очах необхідно звернутися за допомогою до терапевта і офтальмолога. Якщо симптом не пов'язаний з перевтомою, то проводиться ряд досліджень. Основні методи обстеження зорового нерв , сітківки та провідних шляхів мозку:

- МРТ головного мозку і зорових нервів;
- Обстеження полів зору на комп'ютерному периметрі - можуть виявити скотоми;
- Обстеження судин шиї і голови - діагностує порушення в кровообігу та ін.", 7);





INSERT INTO doctor VALUES (NULL, "Терапевт", "Спеціалізація терапевта включає лікування встановленого набору захворювань. До них в першу чергу відносяться застуди та респіраторно-вірусні інфекції (грип, ГРЗ, нежить, інші захворювання). Також терапевт проводить діагностику судинних і серцевих захворювань (ВСД, артеріальна гіпертензія, ішемія, гіпертонія), деяких хвороб крові (анемія), загальних розладів (порушення метаболізму, діатез). Крім того, терапевт надає допомогу при порушенні функціонування шлунково-кишкового тракту, дихальної системи, при синдромі інтоксикації.");
INSERT INTO doctor VALUES (NULL, "Онколог", "Це фахівець з загальної, медичної та радіаційної онкології, який володіє основними методами діагностики і лікування онкологічних захворювань, включаючи хіміо- та радіотерапію.");
INSERT INTO doctor VALUES (NULL, "Невролог", "Лікар-невролог успішно проводить діагностику і лікування захворювань нервової системи, таких як: міжхребцева грижа, радикуліт, сколіоз (дитячий і юнацький), остеохондроз, неврити, неврози, неврастенія, інсульт.");
INSERT INTO doctor VALUES (NULL, "Психіатр", "Лікар-психіатр це лікар, який займається лікуванням психічних розладів.

Сучасний психіатр повинен не тільки знати клінічні прояви психічного розладу, специфіку соматичних і неврологічних проявів при тому чи іншому психічному захворюванні, але і володіти сучасними методами психотерапії.

Психіатр це ерудований в області психології, філософії і теології людина, що володіє високими моральними і духовними цінностями.

Психіатр зобов'язаний провести нейрофизиологическое, біохімічне, гормональне дослідження, а також дослідити серцево - судинну, травну та інші системи організму.");
INSERT INTO doctor VALUES (NULL, "Нарколог", "До компетенції нарколога входить вивчення проявів, етіології і патогенезу токсикоманії та наркоманії, розробляє методи попереджень хвороби, проводить лікування і профілактику.");
INSERT INTO doctor VALUES (NULL, "Інфекціоніст", "Інфекціоніст вивчає виникнення, механізми розвитку та клінічні прояви інфекційних хвороб, що викликаються хвороботворними мікроорганізмами, разрабативзет методи їх лікування та профілактики.");
INSERT INTO doctor VALUES (NULL, "Уролог", "До компетенції уролога входить лікування сечостатевої системи, яка є досить крихкою, тому хоч раз в житті, але в уролога побуває кожна людина. Для профілактики будь-якого захворювання (урологічні не є винятком) рекомендується проходити огляд у уролога раз на рік.

Що є зоною робіт уролога? Це нирки, сечовий міхур, сечовід і сечовий канал, зовнішні статеві органи і передміхурова залоза. Якщо у вас з'явилися болі в паху, ви стали часто мочитися, якщо до того ж ви відчуваєте біль при сечовипусканні, не зволікайте з візитом до уролога.

У сучасному світі багато чоловіків страждають урологічними захворюваннями, такими як, наприклад, простатит. 99% старше сорока років ризикує захворіти на цю хворобу, яка лікується тільки урологом. Тому в цьому віці особливо важливо спостерігатися у уролога в профілактичних цілях, так як запалення простати - не найприємніше, що може трапитися в житті чоловіка. Якщо діагноз поставлений вчасно і точно, то все урологічні хвороби виліковні.

Однак, часто пацієнти звертаються до уролога, коли хвороба вже запущена, що ускладнює її лікування, яке може тривати кілька років, і хвороба може бути не вилікувана до кінця.

Тому профілактика дуже важлива в урології. Найкраще визначитися з одним лікарем-урологом і ходити тільки до одного фахівця. Не варто займатися самолікуванням, тому що найчастіше воно може привести до непоправних наслідків, таким як, наприклад, безпліддя.");
INSERT INTO doctor VALUES (NULL, "Гастроентеролог", "До компетенції лікаря-гастроентеролога входить лікування всіх запальних захворювань кишечника.");
INSERT INTO doctor VALUES (NULL, "Ендокринолог", "До компетенції ендокринолога входять питання, пов'язані з ендокринною системою, діагностикою, лікуванням, попередженням ендокринних захворювань. Гормональними порушеннями в гінекології займається лікар ендокринолог - гінеколог");
INSERT INTO doctor VALUES (NULL, "Алерголог", "У компетенції алерголога варто виявлення конкретних алергенів на які реагують ваші бронхи, для призначення курсу лікування в гострий період захворювання або курсу лікування перед цвітінням (не менше ніж за місяць до цвітіння) потрібно пройти курс лікування алергенами (щеплення від алергії) в осінньо-зимовий період .

Лікар алерголог повинен дати рекомендації про профілактику алергії з чітким зазначенням дозволених і заборонених продуктів харчування в сезон запилення конкретно ваших алергенів.");
INSERT INTO doctor VALUES (NULL, "Офтальмолог", "Лікар офтальмолог вивчає захворювання очей, слізних органів і вік");
INSERT INTO doctor VALUES (NULL, "Окуліст", "Окуліст - це фахівець в сфері клінічної медицини, який вивчає етіологію, діагностику, профілактику, механізми різних захворювань органів зору.

Окуліст здійснює корекцію зору і виліковує практично всі очні захворювання - далекозорість, короткозорість, катаракта, глаукома, амбліопія, астигматизм.");
INSERT INTO doctor VALUES (NULL, "Хірург", "Лікар хірург вивчає хвороби і пошкодження, для яких використовуються спеціальні методи, що порушують цілісність покривних тканин.");
INSERT INTO doctor VALUES (NULL, "ЛОР", "ЛОР - спеціальність, яка включає в себе навички, як терапевта, так і хірурга. У ряді випадків отоларинголог проводить хірургічні операції.

У сферу дії отоларинголога входить лікування захворювань порожнини носа, вуха і гортані.");
INSERT INTO doctor VALUES (NULL, "Травматолог", "Травматолог займається травмами, тобто ушкодженнями кісток, суглобів, м'язів і сухожильно-зв'язкових структур.

Травми завжди були, є і будуть.

І, на жаль, чим далі, тим їх буде більше, тому що блага цивілізації і науково-технічний прогрес привносять в наше життя нові причини травматизму. Наприклад, останнім часом великої популярності набули екстремальні види спорту: тепер ми можемо дозволити собі самі екстравагантні захоплення. На жаль, за ці захоплення багатьом доводиться розплачуватися в кращому випадку порваними зв'язками. Ще 10-15 років тому травматологи, що спеціалізувалися на спортивних травмах, працювали в основному з професійними спортсменами в нечисленних спеціалізованих центрах. А тепер спортивна медицина - один з найбільш затребуваних аспектів травматології.");




#INSERT INTO sickness VALUES (NULL, "Нзава", "Опис", "Симптоми", "Лікування");


INSERT INTO sickness VALUES (NULL, "Глаукома",
"Глаукома - це хронічне захворювання очей, при якому підвищується внутрішньоочний тиск і пошкоджується  зоровий нерв. При цьому зір може  знизитись до настання повної сліпоти. Втрата зору, спричинена глаукомою, носить незворотний характер, тому що гине зоровий нерв. Повернути зір в даному випадку вже не можливо.

Нажаль, глаукома - достатньо розповсюджене захворювання. На нього хворіють, як правило, люди віком старші 40 років. Але бувають випадки, коли ця недуга вражає і молодих людей (юнацька глаукома), і навіть новонароджених (вроджена глаукома).

Важливу  роль в виникненні глаукоми відіграє спадковість. Якщо у ваших родичів була глаукома, вам потрібно бути особливо уважними і регулярно обстежуватись у офтальмолога. Консультація офтальмолога та вимірювання ВОТ навіть один раз на рік дозволить своєчасно виявити та ефективно лікувати захворювання.",
"- Напад глаукоми може виникнути в результаті підвищеної фізичного навантаження або після прийому алкоголю ( тиск в оці підвищується). Якщо після цих маніпуляцій у Вас падає гострота зору (погана видимість в сутінках, погіршення периферичного зору), то у Вас трапився 'напад глаукоми'. Такі напади супроводжуються болем в оці, які обов'язково 'віддають' в голову, зіниця розширена, сльозотеча. 

- з'являються райдужні ореоли при погляді на яскраве світло (лампочка, телевізор); 

- відчувається почуття дискомфорту в області ока; 

- тяжкість, напруження; 

- часте сльозотеча або відчуття підвищеної 'вологості' очей; 

- відчуття, ніби вам в око потрапила вія; 

- погіршення зору (вуаль перед очима). ",
"Сучасні методи лікування дають змогу призупинити прогресування глаукоми, зберігши при цьому зір і працездатність людини. Але це можливо лише за умови раннього виявлення хвороби і суворого виконання пацієнтом усіх рекомендацій лікаря. Для лікування глаукоми застосовують консервативний, хірургічний і лазерний методи. Вибір методу - суто індивідуальний.

При консервативному лікуванні рекомендуються краплі, які знижують внутрішньоочний тиск. Якщо це не допомагає, потрібна операція.

Лазерне лікування глаукоми безболісне, триває недовго і проводиться амбулаторно. Лазерний промінь без перешкод проникає в око і впливає на його дренажну систему, поліпшуючи відтік внутрішньоочної рідини. На жаль, лазер може допомогти не всім.

Хірургічне лікування спрямоване лише на зниження внутрішньоочного тиску. Сучасні операції виконують на мікрохірургічному рівні, що дає змогу впливати точно на уражену структуру ока. Для більшості хворих цей метод є найефективнішим методом лікування глаукоми. Сьогодні вже доведено: що раніше застосовується хірургічне втручання, то стабільніше і якісніше зберігається зір у хворих.");


INSERT INTO sickness VALUES (NULL, "Склероз", 
"Розсіяний склероз - це хронічне неврологічне захворювання, яке триває до кінця життя. Початок прояви розсіяного склерозу буває різним. Іноді після пробудження з ліжка ми не можемо утримати рівновагу; іноді втома валить в крісло, хоча ми не перевантажені роботою. Завжди, коли мова йде про діагноз, ми не готові до цього. Особливо у віці 20-30 років, коли будуємо плани про подальшу життя.",
"Ознаки і симптоми розсіяного склерозу можуть значно варіювати в залежності від локалізації пошкоджених нервових волокон. Серед симптомів розсіяного склерозу називають наступні:

- Оніміння або слабкість однієї або кількох кінцівок, як правило, з одного боку, або нижньої частини тіла.
- Часткова або повна втрата зору, зазвичай на одне око, часто супроводжується болем при рухах очима (ретробульбарний неврит).
- Двоїння або розмитість контурів
- Поколювання або біль у різних частинах тіла
- Відчуття електрошоку при певних рухах голови
- Нервові тремтіння, проблеми з координацією рухів або невпевнена хода
- Підвищена стомлюваність
- Запаморочення

Багато хворих на розсіяний склероз, особливо на початкових стадіях хвороби, відчувають рецидиви симптомів, які супроводжуються періодами повної або часткової ремісії. Ознаки і симптоми розсіяного склерозу часто з'являються або посилюються при підвищенні температури тіла.",
"Через розмаїття симптомів розсіяний склероз не легко діагностувати. Розпізнати хворобу повинен невропатолог. В даний час, завдяки феритовою магнітів можна швидко встановити PC. Вони настільки точні, що дозволяють визначити місце і розмір області, в якої сталося пошкодження мієліну. Обстеження триває протягом 10-30 хвилин і безболісно. Маленькі електроди, розміщені на голові пацієнта, показують, як мозкові хвилі відповідають на те, що хворий бачить і чує. Реєстровані сигнали значно повільніше, коли доходить до демієлінізації.
 
Під місцевою анестезією робиться прокол, під час якої області хребта висмоктують невелику кількість спинномозкової рідини (це називається пункція). Люди з PC у ньому мають антитіла, які свідчать про те, що імунна система здійснила напад в межах центральної нервової системи.
Щоб виключити інші захворювання схожі на PC, виконується аналіз крові, дослідження внутрішнього вуха. В даний час існують вже імуномодулюючі препарати, наприклад, глатирамера ацетат.");

INSERT INTO sickness VALUES (NULL, "Інсульт", 
"Інсульт (інфаркт головного мозку ) - захворювання серцево-судинної системи, при якому порушується кровопостачання мозку. У разі ішемічного типу відбувається зниження або повне припинення кровотечі по церебральним артеріям. При геморагічному типі розвивається крововилив в речовину головного мозку, субарахноїдальний простір або шлуночки.",
"Симптоми інсульту приблизно однакові для ішемічної і геморагічної форми, однак в останньому випадку захворювання протікає більш стрімко. 

Серед симптомів можна виділити загально-мозкові: 
- головний біль; 
- нудота і блювання, пов'язані з підвищенням внутрішньочерепного тиску; 
- епілептиформний припадок, який можна переплутати з нападом епілепсії; 
- тремор рук; 
- кома, обумовлена наростанням набряку мозку та зміщенням серединних структур; 
- порушення дихання і серцебиття, викликані ураженням стовбура мозку. 

Ригідність потиличних м'язів характерна тільки для субарахноїдального крововиливу. Інсульт у жінок нерідко проявляється атиповими ознаками, які включають болі в області серця, обличчя і кінцівок, а також прискорений пульс і задишку .",
"Лікування інсульту (він же інфаркт головного мозку) досить важке завдання, так як тканина мозку найбільш чутлива до впливу ушкоджень. Відомо, що без кисню нейрон може прожити не більше 6 хвилин, а далі настає його смерть. Тому у лікаря дуже мало часу, щоб встигнути врятувати хоча б частину головного мозку. Посилює становище і низька інформованість пацієнтів, з чим пов'язане пізнє звернення за медичною допомогою.

Народне лікування інсульту ні в якому разі не повинно бути єдиним, тобто використовувати його можна лише як доповнення традиційних методів. Для зменшення підвищеного тиску можна застосовувати настій з червоних шишок, який слід приймати по 5 мл три рази на день протягом двох тижнів. Настій з глоду і шкарлупок волоського горіха зміцнює судини мозку і знижує ризик повторного інсульту. При паралічах використовують відвар з листя берези. Його п'ють по півсклянки на добу, а також додають у ванни, щоб знизити м'язовий тонус. Для зниження внутрішньочерепного тиску можна пити настій на кінському каштані по чайній ложці перед кожним прийомом їжі. Перед застосуванням методів народної медицини необхідно проконсультуватися з лікарем.");

INSERT INTO sickness VALUES (NULL, "Шизофренія", 
"Шизофренія — це порушення в роботі головного мозку, які впливають на те, як людина діє, думає, і бачить світ. Люди з шизофренією мають викривлене сприйняття реальності, а часто і зовсім втрачають зв’язок з реальним світом. Вони можуть бачити або чути речі, яких не існує, говорити дивні і незрозумілі речі, вважати, що інші намагаються заподіяти їм шкоду, або відчувати постійне стеження за собою. При таких розмитих границях люди навіть не в змозі жити нормальним, звичним для них життям. Люди можуть повністю втратити контакт з реальним світом, сховатися від усіх і вести себе вкрай дивно, керуючись страхом і розгубленістю.",
"У деяких людей шизофренія виявляється раптово, без появи тривожних симптомів. Однак, найчастіше, перші натяки на хворобу проявляються поступово разом з тривожними ознаками. Багато друзів і родичів пацієнтів з шизофренією розповідають, що бачили, як з людиною відбувається щось не те, проте не знали, що це може бути.

На цій ранній стадії люди з шизофренією часто здаються ексцентричним, невмотивованими, позбавленими емоцій і загадковими. Вони ізолюють себе від суспільства, починають нехтувати своїм зовнішнім виглядом, кажуть дивні речі, демонструють загальну байдужість до життя. Вони можуть відмовитися від улюблених занять, а їх продуктивність на роботі або в школі різко погіршується.

Найчастіше перші ознаки шизофренії включають:

- Соціальна самоізоляція.
- Ворожість або підозрілість.
- Погіршення особистої гігієни.
- Плоский, невиразний погляд.
- Нездатність плакати чи висловлювати радість.
- Безпричинний сміх або плач.
- Депресія.
- Надмірна сонливість або безсоння.
- Незв’язна або ірраціональна мова.
- Забудькуватість, незібраність.
- Гостра реакція на критику.
- Використання дивних, неіснуючих слів.",
"Важливо своєчасно і точно розпізнати початок шизофренії, призначити комплексне і адекватне лікування, побудувати продуману систему реабілітації хворого шизофренією, навчити його і членів сім’ї правильній поведінці.

Велике значення має довіру до лікаря, співробітництво з ним, а також проведення активної соціальної роботи, що враховує особливості сім’ї хворого, його соціальний статус.

Щоб лікування шизофренії було ефективним необхідно правильно підібрати відповідні медикаменти, що усувають симптоми шизофренії, що володіють мінімальною кількістю побічних ефектів і не знижують якість життя.

Найкраще лікування шизофренії треба починати в стаціонарі, воно повинне включати в себе постановку точного діагнозу, оскільки варіантів прояву шизофренії достатньо багато. Бажано, щоб обстановка навколо хворого шизофренією була спокійній (він знаходився один в палаті), щоб лікар, який надає допомогу володів сучасними методами психотерапії. Неприпустимо надати хворого шизофренією самому собі, виключити ту діяльність, яка була йому цікава. Активність хворого шизофренією повинна заохочуватися кваліфікованим персоналом, що знають не тільки медицину, але і психологію. У ряді випадків лікування шизофренії важливо зміцнити сили хворого, підібравши для нього повноцінне харчування, адекватну лікувальну фізкультуру, масаж, фізіотерапію та бальнеотерапію. Навколо хворого шизофренією повинні бути не тільки досвідчені лікарі, але і спеціально навчені психологи, соціальні працівники.

Багато хто вважає, що шизофренія невиліковна. Однак, насправді вихід є.");

INSERT INTO sickness VALUES (NULL, "Харчове отруєння", 
"Харчове отруєння не відноситься до захворювань, але характеризується як стан, при якому відбувається інтоксикація організму через потрапляння в кишечник продуктів недоброякісного приготування. У таких продуктах, зазвичай, вже відбувся процес розмноження різних мікроорганізмів та накопичення виділяються ними токсинів. Тому, потрапляючи в організм через харчовий тракт, такі продукти отруюють його і викликають симптоматику інтоксикації.
Харчове отруєння можна отримати при вживанні неякісно приготовленої їжі, або ж, якщо продукти харчування зберігалися в умовах недотримання термінів і режиму зберігання, в умовах сприятливих для розмноження і розвитку мікроорганізмів, здатних викликати отруєння організму. Такі умови створюються при недотриманні людьми особистих гігієнічних правил, при порушенні санітарних норм і правил при заготівлі, транспортування, зберіганні та приготуванні продуктів харчування.", 
"При харчовому отруєнні симптоми до лікування можуть виявлятися по-різному, це залежить від кількості отрути в з'їденому продукті, від ступеня отруєння, і навіть від виду отрути або токсину, який потрапив в організм разом з продуктом.

Найбільш часті симптоми харчового отруєння  –  біль в області живота або в кінцівках, нудота, що супроводжується блювотою, слабкість з потовиділенням, сильний розлад кишечника і порушення стільця, пронос (іноді з кров'ю або зеленого кольору). Симптоми отруєння у дітей грудного віку можна розпізнати по частому водянистому стільцю і сечовипусканню, по плачу, вказуючому на біль в животі, по блювоті і судомам.

Симптоми важкого харчового отруєння серйозніші – вони можуть виявлятися таким, що синить в пальцях або омертвінням кінцівок, сильними судомами, втратою свідомості. Спостерігається ціаноз (синюшность) слизових оболонок і шкіри, задишка.", 
"Лікування отруєння народними методами включає і протиблювотні препарати. При отруєнні можлива сильна блювота. Таким чином, організм позбавляється від токсинів. Але навіть при порожньому шлунку бувають блювотні позиви. Їх можна зупинити народними засобами.

 - У літрі теплої води розчинити 40 г цукру, 6 г солі і 6 г соди. Випити засіб за 2-3 прийоми.
 - Для крохмального розчину знадобиться 6 г картопляного крохмалю і стакан води кімнатної температури. Випити за один прийом.
 - Пачку желатину розчинити в стакані теплої води і випити.");







INSERT INTO pharmac_groups VALUES (NULL, "Кортикостероїди для застосування в дерматології");
INSERT INTO pharmac_groups VALUES (NULL, "Аналгетики і антипіретики");
INSERT INTO pharmac_groups VALUES (NULL, "Неглікозидні кардіотонічні засоби");



INSERT INTO form_releases VALUES (NULL, "Крем");
INSERT INTO form_releases VALUES (NULL, "Таблетки");
INSERT INTO form_releases VALUES (NULL, "Концентрат для приготування розчину");



INSERT INTO medicine VALUES (NULL, "Полькортолон", "біла однорідна маса зприємним запахом", "1 г крему містить триамцинолону ацетоніду 1мг;допоміжніречовини: спирт цетиловий, ольброт, кислота стеаринова, гліцерин 86%, натріюлаурилсульфат, метилгідроксибензоат, пропілгідроксибензоат, хемодерм 841, водаочищена. ",
1, 1, "Триамцинолон –фторований глюкокортикостероїд з вираженою протизапальною, протиалергічною,протиексудативною та протисвербіжною дією. Легко проникає у роговий шар шкіри,забезпечуючи тривалу дію. Фармакокінетика. Всмоктування триамцинолону ацетоніду через шкірузростає при застосуванні на ніжній шкірі в ділянці складок або на шкіріобличчя, на шкірі з ушкодженим епідермісом і ураженій запальним процесом. Окрімтого, всмоктування збільшується при частому застосуванні лікарського засобу абопісля його нанесення на великі ділянки шкіри. В осіб молодого віку всмоктуваннячерез шкіру значно більше, ніж у дорослих. ",
"Підгострі іхронічні неінфіковані дерматити, які супроводжуються стійким свербежем абогіперкератозом: себорейний дерматит, атопічний дерматит, алергічна контактнаекзема, поліморфна еритема, червоний вовчак, псоріаз, плескатий лишай. ",
"репарат призначений для місцевого застосування. Крем застосовують впершій фазі лікування (перед маззю). Слід нанести тонким шаром на уражену шкіру1 - 2 рази на добу.Не слід застосовувати крем під оклюзійну пов’язку.Лікування не слід проводити безперервно довше 2 тижнів. Не можназастосовувати на шкірі обличчя більше 1 тижня. Протягом тижня рекомендуєтьсязастосовувати не більше 1 туби.Слід з обережністю застосовувати препарат дітям віком від 2 років,тільки 1 раз на добу, на невеликій ділянці шкіри; не наносити на шкіру обличчя.Тривалість лікування – 1 - 2 тижні.",
"Можуть спостерігатися наступні побічні ефекти:вугри, післястероїдна пурпура, пригнічення росту епідермісу, атрофія підшкірноїклітковини, сухість шкіри, надмірний ріст волосся на тілі або алопеція,знебарвлення або гіперпігментація шкіри, атрофія та порушення цілісності шкіри,телеангіоектазії, періоральний дерматит, запалення волосяних фолікулів,вторинні інфекції.",
"Не рекомендується застосовувати Полькортолон при вірусних та первиннихбактеріальних і грибкових інфекціях шкіри, новоутвореннях шкіри, звичайних тарожевих вуграх, періоральному дерматиті, післяпрофілактичних щеплень, а також у разі підтвердженої підвищеної чутливості дотриамцинолону ацетоніду або інших глюкокортикостероїдів і до компонентівпрепарату. ",
"При триваломузастосуванні на великих ділянках шкіри можуть з’явитися симптоми передозування,що проявляються посиленням побічних ефектів (набряки, гіпертензія,гіперглікемія, підвищена чутливість до інфекцій), а в тяжких випадках –розвитком хвороби Кушинга. Однак у зв’язку з місцевим застосуванням препаратувказані симптоми спостерігалися дуже рідко. Терапія симптоматична.",
"Слід уникати довготривалого застосування. Не застосовувати безперервнодовше 2 тижнів. При довготривалому застосуванні на великих ділянках шкіризбільшується частота прояву побічних ефектів.", 185.22);



INSERT INTO symptom_has_doctor VALUES (1, 3);
INSERT INTO symptom_has_doctor VALUES (1, 4);

INSERT INTO symptom_has_doctor VALUES (2, 4);
INSERT INTO symptom_has_doctor VALUES (2, 5);

INSERT INTO symptom_has_doctor VALUES (3, 6);

INSERT INTO symptom_has_doctor VALUES (4, 10);

INSERT INTO symptom_has_doctor VALUES (5, 11);

INSERT INTO symptom_has_doctor VALUES (6, 8);
INSERT INTO symptom_has_doctor VALUES (6, 5);
INSERT INTO symptom_has_doctor VALUES (6, 9);

INSERT INTO symptom_has_doctor VALUES (7, 7);

INSERT INTO symptom_has_doctor VALUES (8, 6);
INSERT INTO symptom_has_doctor VALUES (8, 8);
INSERT INTO symptom_has_doctor VALUES (8, 9);



#---------------

INSERT INTO symptom_has_medicine VALUES (1, 1);

#------------------------------


INSERT INTO symptom_has_sickness VALUES (1, 2);
INSERT INTO symptom_has_sickness VALUES (2, 3);
INSERT INTO symptom_has_sickness VALUES (2, 4);
INSERT INTO symptom_has_sickness VALUES (5, 1);
INSERT INTO symptom_has_sickness VALUES (6, 5);
INSERT INTO symptom_has_sickness VALUES (8, 5);






INSERT INTO types VALUES (NULL, "Лікарня");
INSERT INTO types VALUES (NULL, "Поліклініка");
INSERT INTO types VALUES (NULL, "Диспансер");
INSERT INTO types VALUES (NULL, "Стоматологія");
INSERT INTO types VALUES (NULL, "Аптека");
INSERT INTO types VALUES (NULL, "Медичний центр");




INSERT INTO institutions VALUES (NULL, "Обласний наркологічний диспансер", 3, "Тернопіль, Тролейбусна 14", "(0352) 436146");
INSERT INTO institutions VALUES (NULL, "Обласний клінічний онкологічний диспансер", 3, "Тернопіль, Купчинського 8",  "(0352) 268680");
INSERT INTO institutions VALUES (NULL, "Обласний клінічний шкіро-венерологічний диспансер", 3, "Тернопіль, Князя Острозького 37", "(0352) 523614");
INSERT INTO institutions VALUES (NULL, "Лікарсько-фізкультурний диспансер", 3, "Тернопіль, Старий Ринок 1А", "(0352) 226472");
INSERT INTO institutions VALUES (NULL, "Дитяча поліклініка", 2, "Тернопіль, Федьковича 16", "(0352) 521051");
INSERT INTO institutions VALUES (NULL, "Консультативна поліклініка", 2, "Тернопіль, Чорновола 6", "(0352) 527461");
INSERT INTO institutions VALUES (NULL, "Лікарня №1", 1, "Тернопіль, Шпитальна 2", "(0352) 527407");
INSERT INTO institutions VALUES (NULL, "Лікарня №2", 1, "Тернопіль, Купчинського 14", "(0352) 263775");
INSERT INTO institutions VALUES (NULL, "Лікарня №3", 1, "Тернопіль, Волинська 40", "(0352) 535110");
INSERT INTO institutions VALUES (NULL, "Обласна клінічна комунальна психоневрологічна лікарня", 1, "Тернопіль, Тролейбусна 14", "(0352) 435736");
INSERT INTO institutions VALUES (NULL, "Обласна комунальна поліклініка", 2, "Тернопіль, Клінічна 4", "(0352) 524138");
INSERT INTO institutions VALUES (NULL, "Поліклініка №1", 2, "Тернопіль, Князя Острозького 6", "(0352) 524552");
INSERT INTO institutions VALUES (NULL, "Поліклініка №2", 2, "Тернопіль, Купчинського 14", "(0352) 263310");
INSERT INTO institutions VALUES (NULL, "Поліклініка №3", 2, "Тернопіль, Волинська 40", "(0352) 536971");
INSERT INTO institutions VALUES (NULL, "Стоматологія Олексюка", 4, "Тернопіль, Глибока 25", "(098) 1301371");
INSERT INTO institutions VALUES (NULL, "Центральна районна лікарня", 1, "Тернопіль, Князя Острозького 9", "(0352) 527785");
INSERT INTO institutions VALUES (NULL, "Центральна районна поліклініка", 2, "Тернопіль, Князя Острозького", "(0352) 255620");
INSERT INTO institutions VALUES (NULL, "Стоматологія Вісан", 4, "Тернопіль, Медова 20", "(0352) 525558");
INSERT INTO institutions VALUES (NULL, "Стоматологія Denta VI", 4, "Тернопіль, Руська 11", "(0352) 220441");
INSERT INTO institutions VALUES (NULL, "Стоматологія Viva", 4, "Тернопіль, Орлика 1", "(0352) 436344");
INSERT INTO institutions VALUES (NULL, "Стоматологія Люм-Дента", 4, "Тернопіль, Хмельницького 19", "(067) 8119455");
INSERT INTO institutions VALUES (NULL, "Дитяча стоматологічна поліклініка", 4, "Тернопіль, 15 квітня 1А", "(0352) 269759");

INSERT INTO institutions VALUES (NULL, "Аптека цілодобова", 5, "Тернопіль, Федьковича 16", "(0352) ");
INSERT INTO institutions VALUES (NULL, "Аптека цілодобова", 5, "Тернопіль, Купчинського 9", "(0352) 263455");
INSERT INTO institutions VALUES (NULL, "Аптека цілодобова", 5, "Тернопіль, Шпитальна 3", "(0352) 528147");
INSERT INTO institutions VALUES (NULL, "Аптека цілодобова", 5, "Тернопіль, Київська 5", "(0352) 511967");
INSERT INTO institutions VALUES (NULL, "Аптека цілодобова", 5, "Тернопіль, Купчинського 14", "(0352) 423309");
INSERT INTO institutions VALUES (NULL, "Аптека цілодобова", 5, "Тернопіль, Руська 49", "(0352) 423358");
INSERT INTO institutions VALUES (NULL, "Аптека цілодобова", 5, "Тернопіль, Монастирського 48", "(0352) 514010");
INSERT INTO institutions VALUES (NULL, "Аптека цілодобова", 5, "Тернопіль, Лесі Українки 37", "(0352) 513551");
INSERT INTO institutions VALUES (NULL, "Аптека цілодобова", 5, "Тернопіль, Замкова 8", "(0352) 524509");
INSERT INTO institutions VALUES (NULL, "Аптека цілодобова", 5, "Тернопіль, Леся Курбаса 4", "(0352) 510251");

INSERT INTO institutions VALUES (NULL, "Віасан", 6, "Тернопіль, Медова 20", "(0352) 525558");
INSERT INTO institutions VALUES (NULL, "Оксфорд Медікал", 6, "Тернопіль, Качали 5", "(068) 7525252");
INSERT INTO institutions VALUES (NULL, "Румед-Т", 6, "Тернопіль, Вишневецького 1/53", "(0352) 401117");
INSERT INTO institutions VALUES (NULL, "Санітас", 6, "Тернопіль, Шевченка 12", "(097) 4628555");






#SELECT i.ID, t.kind, i.title, i.address, i.phone FROM insitutions as i JOIN types as t ON i.kind = t.ID;

/*
select * from information_schema.columns
where table_schema = 'handbook'
AND COLUMN_NAME = 'title'
AND TABLE_NAME NOT LIKE '%_union';
*/




#SELECT substring ('головний біль', 1, 8);

#SELECT strSplit();

#SELECT * FROM symptom WHERE title LIKE '%біль%';

#SELECT * FROM sickness WHERE title LIKE '%головний біль%'

#SELECT * FROM insitutions WHERE title LIKE '%лік%'

#SELECT * FROM medicine WHERE title LIKE 'лік';


#SELECT * FROM institutions;

#SELECT * FROM symptom WHERE title LIKE CONCAT('%', SPLIT_STRING('Головний біль', 1), '%');


























































